Revit 2024 API
ExternalServices Class
Provides a container of all Revit built-in ExternalServiceId instances.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ExternalServices
Visual Basic
Public NotInheritable Class ExternalServices
Visual C++
public ref class ExternalServices abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalService.ExternalServices
See Also
Autodesk.Revit.DB.ExternalService Namespace